app/controllers/api/v1/articles_controller.rb

SELECT "events".* FROM "events"
---
			def allevent
				event=Event.all();

SELECT  "events".* FROM "events" WHERE "events"."Event_id" IS NULL LIMIT ?  [["LIMIT", 1]]
---
			def eventbyid

				id=params[:id]
				event=Event.find_by_Event_id(id);