app/controllers/home_controller.rb

	def events
		@event=Event.all();
---
SELECT "events".* FROM "events"